tutorials/verificationAndValidation/atmosphericModels/atmForestStability/system/setFieldsDict.template
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2006                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      setFieldsDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

defaultFieldValues
(
    volScalarFieldValue qPlant 0
    volScalarFieldValue plantCd 0
    volScalarFieldValue leafAreaDensity 0
);

regions
(
    boxToCell
    {
        box (0 0 8.60799) (200 200 18.2192);
        fieldValues
        (
            volScalarFieldValue qPlant Q_PLANT
        );
    }

    boxToCell
    {
        box (0 0 0) (200 200 18.2192);
        fieldValues
        (
            volScalarFieldValue plantCd 0.2
            volScalarFieldValue leafAreaDensity 0.14
        );
    }

    patchToFace
    {
        patch                    bottom;
        fieldValues
        (
            volScalarFieldValue plantCd 0.2
            volScalarFieldValue leafAreaDensity 0.14
        );
    }
);


// ************************************************************************* //
